//=============================================================================
//
// X-Bow Hunterの処理 [game.h] (ゲーム画面)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_
#define _CRT_SECURE_NO_WARNINGS_
//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define COUNT_WAIT_FINISH_GAME (30)	//リザルト画面へ行くまでの時間

//=============================================================================
// 構造体定義
//=============================================================================
typedef enum
{
	GAMESTATE_NONE,
	GAMESTATE_NORMAL,
	GAMESTATE_END,//ゲーム終了状態
	GAMEDTATE_CLEAR,
	GAMESTATE_OVER,
	GAMESTATE_MAX
}GAMESTATE;

typedef enum
{
	AREYOUHUCKER？_NO,
	AREYOUHUCKER？_YES,
}HUCKERSTATE;	//デバックコマンドの使用有無

				//=============================================================================
				//プロトタイプ宣言
				//=============================================================================
void InitGame1(void); //一度に読み込むと重くなるので2つにわけている
void InitGame2(void);
void UpdateGame(void);
void UninitGame(void);
void DrawGame(void);

void SetGameState(GAMESTATE state);//ゲームの状態
HUCKERSTATE GetGameState(void);
#endif