//=============================================================================
//
// X-Bow Hunter [item.h]の処理 (アイテム)
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _ITEM_H_
#define _ITEM_H_
#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define	MAX_ITEM (128)	//アイテムの最大数
#define ITEM_SIZE (100)	//アイテムの大きさ

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
	ITEMTYPE_000 = 0,
	ITEMTYPE_001,
	ITEMTYPE_MAX
}ITEMTYPE;//アイテムの種類

typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 move;	//移動量
	int nType;			//種類
	bool bUse;			//使用しているかどうか
}ITEM;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitItem(void);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);

void SetItem(D3DXVECTOR3 pos, ITEMTYPE nType);
ITEM*GetItem(void);

#endif