//=============================================================================
//
// X-Bow-Hunterの処理 [storm.h] (ボスのストーム)
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _STORM_H_
#define _STORM_H_
#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define MAX_STORM (128)

//=============================================================================
//構造体定義
//=============================================================================
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 move;	//移動量
	int nLife;			//寿命
	D3DXCOLOR col;
	int nHitPosX;		//弾が地面についた時のX座標
	int nSize;
	bool bUse;			//使用しているかどうか
}STORM;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitStorm(void);
void UninitStorm(void);
void UpdateStorm(void);
void DrawStorm(void);
void SetStorm(D3DXVECTOR3 pos, D3DXVECTOR3 move, int nLife, D3DXCOLOR col, int nHitPosX, int nSize);
STORM*GetStorm(void);
#endif