//=============================================================================
//
// X-Bow Hunterの処理 [title.h] (タイトル)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_
#define _CRT_SECURE_NO_WARNINGS_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define PRESS_ENTER_X (460)//画像のサイズ（縦）
#define PRESS_ENTER_Y (80)//画像のサイズ（横）

#define NORMAL_HARD_X (260)//画像のサイズ（縦）
#define NORMAL_HARD_Y (70)//画像のサイズ（横）

#define TITLE_UI (4)	//タイトルの表示物

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
	GAMELEVEL_NORMAL = 0,	//ノーマルレベル
	GAMELEVEL_HARD,			//ハードレベル
	GAMELEVEL__MAX			//難易度の最大数
}GAMELEVEL;

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitTitle(void);
void UpdateTitle(void);
void UninitTitle(void);
void DrawTitle(void);
GAMELEVEL GetTitle(void);	//難易度の取得
#endif