//=============================================================================
//
//	最強昔話決定戦の処理 [fire.h](爆弾から発する炎)
//	Author:後藤慎之助
//
//=============================================================================
#ifndef _FIRE_H_
#define _FIRE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_FIRE (256)

//=============================================================================
//構造体定義
//=============================================================================

typedef struct
{
    DWORD MatFire = 0;//マテリアル情報の数
    D3DXVECTOR3 pos;
    D3DXVECTOR3 rot;
    D3DXVECTOR3 size;
    SELECT type;     // タイプ
    D3DXMATRIX mtxWorld;//行列計算用
    LPD3DXMESH pMeshFire;//マテリアル情報のポインタ
    DWORD nNumMatFire;	//マテリアル情報の数
    bool bUse;
    int nCntTime;       //炎の発生フレーム
}FIRE;

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitFire(void);
void UninitFire(void);
void UpdateFire(void);
void DrawFire(void);
FIRE* GetFire(void);
bool HitFire(D3DXVECTOR3* pPos, D3DXVECTOR3* pPosOld, D3DXVECTOR3 size);
void SetFire(D3DXVECTOR3 pos, SELECT type);
bool HitMomoFire(D3DXVECTOR3* pPos, D3DXVECTOR3* pPosOld, D3DXVECTOR3 size);    //ボスは桃太郎の爆弾のみくらう
#endif