//=============================================================================
//
// 最強昔話決定戦 [input.h]の処理 (キーボード操作)
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _INPUT_H_
#define _INPUT_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
HRESULT InitKeyboard(HINSTANCE hInstance, HWND hWnd);
void UninitKeyboard(void);
void UpdateKeyboard(void);

bool GetKeyboardPress(int nKey);
bool GetKeyboardTrigger(int nKey);
bool GetKeyboardRelease(int nKey);

#endif
