//=============================================================================
//
// 最強昔話決定戦の処理 [manual.h] (遊び方)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _MANUAL_H_
#define _MANUAL_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitManual(void);
void UpdateManual(void);
void UninitManual(void);
void DrawManual(void);

bool GetHiddenCommand(void);    //隠しコマンド
bool GetHiddenCommand2(void);   //隠しコマンド2
bool GetHiddenCommand3(void);   //隠しコマンド3
bool GetHiddenCommand4(void);   //隠しコマンド4
#endif