//=============================================================================
//
// 最強昔話決定戦の処理 [pause.h] (ポーズ機能)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
    PAUSE_SELECT_CONTINUE_GAME = 0,	//ゲームをつづける
    PAUSE_SELECT_QUIT_GAME,			//ゲームをやめる
}PAUSE_SELECT;	//ポーズ中の選択肢

//ポーズの管理情報
typedef struct
{
    SELECT who;      //ポーズを押した人
}PAUSE;

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitPause(void);
void UpdatePause(void);
void UninitPause(void);
void DrawPause(void);

PAUSE*GetPause(void);
#endif