//=============================================================================
//
// 最強昔話決定戦の処理 [ranking.h] (ランキング)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _RANKING_H_
#define _RANKING_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define RANKINGSCORE_SIZE_X (700.0f/10.0f)	//スコアの横のサイズ(左の数字が、全体の大きさ）
#define RANKINGSCORE_SIZE_Y (80.0f)		    //スコアの縦のサイズ

#define RANKING_SPACE (120.0f)  //ランキングの間隔
#define RANKING_HEIGHT (500.0f) //値を高くすれば、スコアの値が上に上がる

#define RANKING_SCORE_MAX (6)   //5位まで(内部で6つの値を計算するため6)

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitRanking(void);
void UpdateRanking(void);
void UninitRanking(void);
void DrawRanking(void);

void ReadScore(void);   //外部ファイルからスコアを読み込む
#endif