//=============================================================================
//
// 最強昔話決定戦の処理 [result.h] (結果発表)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// 構造体定義
//=============================================================================
typedef enum
{
    RESULTSTATE_GAMEOVER,   //ゲームオーバー
    RESULTSTATE_WIN1,       //プレイヤー1の勝ち
    RESULTSTATE_WIN2,       //プレイヤー2の勝ち
    RESULTSTATE_WIN3,       //プレイヤー3の勝ち
    RESULTSTATE_WIN4,       //プレイヤー4の勝ち
    RESULTSTATE_GAMECLEAR,  //ゲームクリア
    RESULTSTATE_PERFECT,    //パーフェクト
    RESULTSTATE_MAX
}RESULTSTATE;

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitResult(void);
void UpdateResult(void);
void UninitResult(void);
void DrawResult(void);
#endif