//=============================================================================
//
// 最強昔話決定戦の処理 [score.h] (ストーリーのスコア)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _SCORE_H_
#define _SCORE_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define SCORE_SIZE_X (200.0f/10.0f)	//スコアの横のサイズ
#define SCORE_SIZE_Y (40.0f)		//スコアの縦のサイズ

#define MAX_SCORE (8)//スコアの桁の数

#define BREAK_BLOCK_SCORE 500       //ブロックを壊した時のスコア
#define GET_ITEM_SCORE 1750         //アイテムを手に入れた時のスコア

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitScore(void);			    //初期化処理
void UpdateScore(void);			    //更新処理
void UninitScore(void);			    //終了処理
void DrawScore(void);			    //描画処理
void ScoreCalculation(int score);	//スコアの計算
int GetScore(void);                 //スコアの取得
void ResetScore(void);              //スコアのリセット

#endif