//=============================================================================
//
// 最強昔話決定戦の処理 [stage.h](ステージをグリッドで管理)
// Author:KUDO AYANO
//
//=============================================================================
#ifndef _STAGE_H_
#define _STAGE_H_

#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_GRID (256)

//*****************************************************************************
//構造体/列挙型定義
//*****************************************************************************

typedef struct
{
    bool isPlaced;      //オブジェクトが置かれているかどうか
}OBJECT_PLACED_INFO;

//*****************************************************************************
//プロトタイプ宣言
//*****************************************************************************
void InitStage(void);
D3DXVECTOR3 ConversionGrid(D3DXVECTOR3 *pos);
bool ConfirmationGrid(D3DXVECTOR3 pos);
void SetGridInfo(D3DXVECTOR3 pos, bool Placed);
void InputStageData(void);
#endif  //_STAGE_H_