//=============================================================================
//
// 最強昔話決定戦の処理 [time.h] (制限時間、サドンデス)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define TIME_SIZE_X (280.0f/10.0f)	//制限時間の横のサイズ
#define TIME_SIZE_Y (73.0f)			//制限時間の縦のサイズ

#define MAX_TIME (2)				//制限時間の桁の数
#define TIME_FIREST_SECOND (0)		//制限時間の最初の秒数

#define TIME_COLOR D3DCOLOR_RGBA(173, 73, 225, 255) //制限時間の色

//サドンデス関連
#define SUDDEN_DEATH_SET_BLOCK 20       //次のブロックを置くまでのフレーム数
#define SUDDEN_DEATH_BLOCK_Y 750.0f     //セットするブロックの高さ

//=============================================================================
//グローバル変数
//=============================================================================
extern int g_nTimeSecond;	    //制限時間の秒

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitTime(void);		//初期化処理
void UpdateTime(void);		//更新処理
void UninitTime(void);		//終了処理
void DrawTime(void);		//描画処理

#endif