//=============================================================================
//
// 最強昔話決定戦 [ui.h]の処理 (ゲーム画面のUI)
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _UI_H_
#define _UI_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define MAX_UI (32)          //1画面に配置するUIの最大数
#define BAR_EXTEND (7.7f)	 //バーの背景を広げる

//=============================================================================
//グローバル変数
//=============================================================================
extern int g_nTimeMinute;  //制限時間の分

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
    UITYPE_000 = 0,		//制限時間の分
    UITYPE_001,         //:
    UITYPE_002,		    //プレイヤー1
    UITYPE_003,         //プレイヤー2
    UITYPE_004,		    //プレイヤー3
    UITYPE_005,         //プレイヤー4
    UITYPE_006,		    //プレイヤー1の得点
    UITYPE_007,         //プレイヤー2の得点
    UITYPE_008,		    //プレイヤー3の得点
    UITYPE_009,         //プレイヤー4の得点
    UITYPE_010,         //よーい/はじめ
    UITYPE_011,         //急げ～
    UITYPE_012,         //引き分け
    UITYPE_013,         //nセット先取
    UITYPE_014,         //バトルロイヤル/ストーリー
    UITYPE_015,         //ふつう/鬼
    UITYPE_016,         //HPバーの背景
    UITYPE_017,         //HPバー
    UITYPE_018,         //HPの文字
    UITYPE_019,         //スコアの背景
    UITYPE_020,         //ボスのHPバーの背景
    UITYPE_021,         //ボスのHPバー
    UITYPE_022,         //BOSS
    UITYPE_MAX			//種類の最大数
}UITYPE;	//UIの種類

typedef struct
{
    D3DXVECTOR3 pos;	//位置
    float fSizeX;		//横
    float fSizeY;       //縦
    UITYPE type;		//種類
    int nCounterAnim;	//アニメーションカウンター
    int nPatternAnim;	//アニメーションパターン
    bool bUse;          //使用しているかどうか
}UI;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitUI(void);
void UninitUI(void);
void UpdateUI(void);
void DrawUI(void);

void SetUI(D3DXVECTOR3 pos, float fSizeX, float fSizeY, UITYPE type);

#endif