//=====================================================
//
// PLASTIC TROOPERS [meshfield.h]の処理 (床)
// Author:後藤慎之助
//
//=====================================================
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define FIELD_WIDTH		(50)	//横の数
#define FIELD_HEIGHT	(50)	//縦の数(50)
#define FIELD_WIDTH_SIZE	(5000.0f)   //全体の横の大きさ(5000)
#define FIELD_HEIGHT_SIZE	(5000.0f)   //全体の縦の大きさ

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMeshField(void);
void UninitMeshField(void);
void UpdateMeshField(void);
void DrawMeshField(void);

#endif