//=============================================================================
//
// ナインストーリーズの処理 [select.h] (遊び方)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _SELECT_H_
#define _SELECT_H_
#define _CRT_SECURE_NO_WARNINGS_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define SELECT_UI (5)	//セレクトの表示物

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitSelect(void);
void UpdateSelect(void);
void UninitSelect(void);
void DrawSelect(void);
CSELECT GetCSelect(void);	//キャラ選択の取得
WSELECT GetWSelect(void);	//武器選択の取得
SSELECT GetSSelect(void);	//盾選択の取得
#endif