//=============================================================================
//
// 3Dゲーム制作の処理 [shadow.h]
// Author:後藤慎之助
//
//=============================================================================
#ifndef _SHADOW_H_
#define _SHADOW_H_

#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
//マクロ定義
//=============================================================================
//#define MAX_SHADOW (32)	//影の最大数
//#define SHADOW_SIZE (25)	//影の大きさ
#define SHADOW_HEIGHT (0.1f)	//yが0.0だと、床と被るため

//=============================================================================
//構造体定義
//=============================================================================
typedef struct
{
    D3DXVECTOR3 pos;		//位置情報
    D3DXVECTOR3 rot;		//回転情報
    D3DXMATRIX mtxWorld;	//行列計算用
    bool bUse;				//使用しているかどうか
}SHADOW;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitShadow(void);
void UninitShadow(void);
int SetShadow(D3DXVECTOR3 pos, D3DXVECTOR3 rot);
void SetPositionShadow(int nldxShadow, D3DXVECTOR3 pos);
void DrawShadow(void);

#endif