//=============================================================================
//
// PLASTIC TROOPERSの処理 [title.h] (タイトル)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_
#define _CRT_SECURE_NO_WARNINGS_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define PRESS_ENTER_X (460)//画像のサイズ（縦）
#define PRESS_ENTER_Y (80)//画像のサイズ（横）

#define NORMAL_HARD_X (260)//画像のサイズ（縦）
#define NORMAL_HARD_Y (70)//画像のサイズ（横）

#define TITLE_UI (8)	//タイトルの表示物

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
	LEVEL_NORMAL = 0,	//ノーマルレベル
	LEVEL_HARD,			//ハードレベル
	LEVEL_MAX			//難易度の最大数
}LEVEL;	//キャンペーンの難易度

typedef enum
{
	SURVIVALTIME_1m = 0,	//1分
	SURVIVALTIME_3m,		//3分
	SURVIVALTIME_INFINITY,	//無制限
	SURVIVALTIME_MAX		//サバイバル時間の最大数
}SURVIVALTIME;	//サバイバル時間

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitTitle(void);
void UpdateTitle(void);
void UninitTitle(void);
void DrawTitle(void);
MODE GetModeTitle(void);            //モード選択の取得
LEVEL GetLevelTitle(void);          //キャンペーン難易度の取得
SURVIVALTIME GetSurvivalTitle(void);//サバイバル時間の取得

#endif