//=============================================================================
//
// PLASTIC TROOPERS [ui.h]の処理 (ゲーム画面のUI)
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _UI_H_
#define _UI_H_
#define _CRT_SECURE_NO_WARNINGS_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define MAX_UI (32)          //1画面に配置するUIの最大数
#define BAR_EXTEND (7.7f)	 //バーの背景を広げる

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
    UITYPE_000 = 0,		//スコアの背景（右上）
    UITYPE_001,			//キャンペーン
    UITYPE_002,			//サバイバル
    UITYPE_003,			//バーサス
    UITYPE_004,			//プラクティス
    UITYPE_005,     	//必殺ゲージの背景
    UITYPE_006,         //HP/ENERGYゲージの背景
    UITYPE_007,         //ON/OFF
    UITYPE_008,         //HPの文字
    UITYPE_009,         //ENERGYの文字
    UITYPE_010,         //HPゲージ
    UITYPE_011,         //ENERGYゲージ
    UITYPE_012,         //必殺ゲージ
    UITYPE_013,         //必殺の数字
    UITYPE_014,         //剣
    UITYPE_015,         //銃
    UITYPE_016,         //Yボタン
    UITYPE_017,         //プレスR
    UITYPE_018,         //スピニングブレード
    UITYPE_019,         //スプレッドファイア
    UITYPE_020,         //ボスのHPの背景
    UITYPE_021,         //ボスのHPバー
    UITYPE_022,         //BOSSの文字
    UITYPE_MAX			//種類の最大数
}UITYPE;	//UIの種類

typedef struct
{
    D3DXVECTOR3 pos;	//位置
    float fSizeX;		//横
    float fSizeY;       //縦
    UITYPE type;		//種類
    int nCounterAnim;	//アニメーションカウンター
    int nPatternAnim;	//アニメーションパターン
    bool bUse;          //使用しているかどうか
}UI;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitUI(void);
void UninitUI(void);
void UpdateUI(void);
void DrawUI(void);

void SetUI(D3DXVECTOR3 pos, float fSizeX, float fSizeY, UITYPE type);
#endif