//=============================================================================
//
// PLASTIC TROOPERSの処理 [wall.h]（黄色透明の壁）
// Author:後藤慎之助
//
//=============================================================================
#ifndef _WALL_H_
#define _WALL_H_
#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// マクロ定義
//=============================================================================
#define WALL_SIZE (1000.0f)
#define WALL_SIZE_Y (500.0f)
#define MAX_WALL (16)

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
    WALLTYPE_YELLOW = 0, //黄色
    WALLTYPE_RED1,       //赤色
    WALLTYPE_RED2,       //赤色
    WALLTYPE_RED3,       //赤色
    WALLTYPE_MAX
}WALLTYPE;

typedef struct
{
    D3DXVECTOR3 pos;		//位置
    D3DXVECTOR3 rot;		//回転情報
    D3DXMATRIX mtxWorld;	//行列計算用
    WALLTYPE type;          //種類
    bool bUse;				//使用判定
}WALL;

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitWall(void);
void UpdateWall(void);
void SetWall(D3DXVECTOR3 pos, D3DXVECTOR3 dir,WALLTYPE type);
void DrawWall(void);
void UninitWall(void);

WALL*GetWall(void);

#endif