//=============================================================================
//
// ナインストーリーズ [effect2.h]の処理 (回復や二段ジャンプのエフェクト）
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _EFFECT2_H_
#define _EFFECT2_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define MAX_EFFECT2 (64)	//爆発の最大数

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
	EFFECTTYPE_000 = 0,		//回復
	EFFECTTYPE_001,			//二段ジャンプ
	EFFECTTYPE_002,			//召喚
	EFFECTTYPE_003,			//着地の煙
	EFFECTTYPE_004,			//自機が背景へ吸い込まれる
	EFFECTTYPE_MAX			//種類の最大数
}EFFECTTYPE;	//エフェクトの種類

typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXCOLOR col;		//色
	int nCounterAnim;	//カウンター
	int nPatternAnim;	//パターンNo
	int nSize;			//大きさ
	EFFECTTYPE type;		//種類
	bool bUse;			//使用しているかどうか
}EFFECT2;	//エフェクトの情報

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitEffect2(void);
void UninitEffect2(void);
void UpdateEffect2(void);
void DrawEffect2(void);
void SetEffect2(D3DXVECTOR3 pos, D3DXCOLOR col, int nSize, EFFECTTYPE type);

#endif