//=============================================================================
//
// ナインストーリーズの処理 [effect.h] (自機の攻撃のエフェクト)
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _EFFECT_H_
#define _EFFECT_H_
#define _CRT_SECURE_NO_WARNINGS_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define MAX_EFFECT (512)

//=============================================================================
//構造体定義
//=============================================================================
typedef struct
{//エフェクトの情報
	D3DXVECTOR3 pos;		//位置
	D3DXCOLOR col;			//色
	float aRadius;			//半径
	float fColAlphavalue;	//
	int nLife;				//時間
	DIRECT nDirect;			//向き
	bool bUse;				//使用しているかどうか
}EFFECT;//エフェクトの情報

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitEffect(void);
void UpdateEffect(void);
void UninitEffect(void);
void DrawEffect(void);
void SetEffect(D3DXVECTOR3 pos, D3DXCOLOR col, float aRadius, int nLife, DIRECT nDirect);
EFFECT *GetEffect(void);

#endif