//=============================================================================
//
// ナインストーリーズの処理 [game2.h] (ゲーム画面2(塔内部))
// Author:後藤慎之助
//
//=============================================================================
#ifndef _GAME2_H_
#define _GAME2_H_
#define _CRT_SECURE_NO_WARNINGS_
//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// 構造体定義
//=============================================================================
typedef enum
{
	GAMESTATE2_NONE,
	GAMESTATE2_NORMAL,
	GAMESTATE2_NEXTSTAGE,	//次のステージへ
	GAMESTATE2_GAMEOVER,	//ゲームオーバー
	GAMESTATE2_MAX
}GAMESTATE2;

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitGame2(void);
void UpdateGame2(void);
void UninitGame2(void);
void DrawGame2(void);

void SetGameState2(GAMESTATE2 state);//ゲームの状態
//HUCKERSTATE2 GetGameState(void);
#endif