//=============================================================================
//
// ナインストーリーズの処理 [game3.h] (ゲーム画面3(塔の頂))
// Author:後藤慎之助
//
//=============================================================================
#ifndef _GAME3_H_
#define _GAME3_H_
#define _CRT_SECURE_NO_WARNINGS_
//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// 構造体定義
//=============================================================================
typedef enum
{
	GAMESTATE3_NONE,
	GAMESTATE3_NORMAL,
	GAMESTATE3_GAMECLEAR,	//ゲームクリア
	GAMESTATE3_GAMEOVER,	//ゲームオーバー
	GAMESTATE3_MAX
}GAMESTATE3;

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitGame3(void);
void UpdateGame3(void);
void UninitGame3(void);
void DrawGame3(void);

void SetGameState3(GAMESTATE3 state);//ゲームの状態

#endif