//=============================================================================
//
// ナインストーリーズの処理 [game.h] (ゲーム画面1(雪のステージ))
// Author:後藤慎之助
//
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_
#define _CRT_SECURE_NO_WARNINGS_
//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
// 構造体定義
//=============================================================================
typedef enum
{
	GAMESTATE_NONE,
	GAMESTATE_NORMAL,
	GAMESTATE_NEXTSTAGE,//次のステージへ
	GAMESTATE_GAMEOVER,	//ゲームオーバー
	GAMESTATE_MAX
}GAMESTATE;

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitGameFirst(void); //一度に読み込むと重くなるので3つにわけている
void InitGameSecond(void); //一度に読み込むと重くなるので3つにわけている
void InitGameThird(void); //一度に読み込むと重くなるので3つにわけている
void UpdateGame(void);
void UninitGame(void);
void DrawGame(void);

void SetGameState(GAMESTATE state);//ゲームの状態
#endif