//=============================================================================
//
// ナインストーリーズ [item.h]の処理 (アイテム)
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _ITEM_H_
#define _ITEM_H_
#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define	MAX_ITEM (64)	//アイテムの最大数

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
	ITEMTYPE_000 = 0,	//壺
	ITEMTYPE_001,		//ダイヤモンド
	ITEMTYPE_002,		//樽
	ITEMTYPE_003,		//ハート
	ITEMTYPE_004,		//つららの姫
	ITEMTYPE_005,		//姫
	ITEMTYPE_MAX
}ITEMTYPE;//アイテムの種類

typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 move;	//移動量
	ITEMTYPE type;		//種類
	int nSize;			//大きさ
	bool bUse;			//使用しているかどうか
}ITEM;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitItem(void);
void UninitItem(void);
void UpdateItem(void);
void DrawItem(void);

void SetItem(D3DXVECTOR3 pos, ITEMTYPE type, int nSize);
ITEM*GetItem(void);

#endif