//=============================================================================
//
// ナインストーリーズ [magic.h]の処理（プレイヤーの魔法）
// Author : 後藤慎之助
//
//=============================================================================
#ifndef _MAGIC_H_
#define _MAGIC_H_
#define _CRT_SECURE_NO_WARNINGS

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define MAX_MAGIC (32)		//魔法の最大数

//=============================================================================
//構造体定義
//=============================================================================
typedef enum
{
	MAGICTYPE_FIRE = 0,		//炎
	MAGICTYPE_LIGHTNING,	//雷
	MAGICTYPE_DRAIN,		//吸収
	MAGICTYPE_MAX			//種類の最大数
}MAGICTYPE;	//魔法選択

typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 move;	//移動量
	int nLife;			//魔法全体のフレーム数
	D3DXCOLOR col;		//色
	MAGICTYPE type;		//種類
	int nSize;			//大きさ
	bool bUse;			//使用しているかどうか
}MAGIC;	//魔法の情報

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitMagic(void);
void UninitMagic(void);
void UpdateMagic(void);
void DrawMagic(void);
void SetMagic(D3DXVECTOR3 pos, D3DXVECTOR3 move, int nLife, D3DXCOLOR col, MAGICTYPE type, int nSize);
MAGIC*GetMagic(void);
#endif