//=============================================================================
//
// ナインストーリーズの処理 [time.h] (制限時間)
// Author:後藤慎之助
//
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_
#define _CRT_SECURE_NO_WARNINGS_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define TIME_SIZE_X (280.0f/10.0f)	//制限時間の横のサイズ
#define TIME_SIZE_Y (73.0f)			//制限時間の縦のサイズ

#define MAX_TIME (3)					//制限時間の桁の数
#define TIME_LIMIT (300)				//制限時間は300秒

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitTime(void);		//初期化処理
void UpdateTime(void);		//更新処理
void UninitTime(void);		//終了処理
void DrawTime(void);		//描画処理
int GetTime(void);			//制限時間の取得
#endif